// let x = 2;
// let y = 2;
// let result = Math.pow(x, y);
// console.log(result);

// var x = 3;
// for(var i = 0; i < 10; i++) {
//     let result = Math.pow(x, i);
//     console.log(result);
// };
/////////////////////////////////////////////
var myTest = function pow(x, y) {
    let result = 1; 
    for (let i = 0; i < y; i++) {
      result *= x; 
    }
    return result;
  }
 console.log( myTest(2, 4) ); 
 //1: i = 0 --> 0 < 4 --> 1 * 2 = 2;
 //2: i = 1 --> 1 < 4 --> 2 * 2 = 4;
 //3: i = 2 --> 2 < 4 --> 4 * 2 = 8;
 //4: i = 3 --> 3 < 4 --> 8 * 2 = 16;
 //5: i = 4 --> 4 < 4 --> stop the process




 // перше коло циклу:
 // result = 1
 // множимо 1 на х --> на цьому етапі ми вже перезаписали значення для result і тепер воно = х
 // друге коло циклу:
 // result = х
 // множимо х на х --> на цьому етапі ми знову перезаписали значення для result і тепер воно = х^2
 // третэ коло циклу:
 // result = х^2
 // множимо х^2 на х --> на цьому етапі ми знову перезаписали значення для result і тепер воно = х^3
 // і так далі поки цикл не завершиться 
 // а коли заверишиться цикл? А тоді коли умова i < y дасть результат false, тобто якщо y = 10, то цикл пройде 9 кіл перед тим як зупинитися
 // після завершення циклу ми виводимо останній результат який ми отримали